In [2]:
# import required libraries
import pandas as pd
import numpy as np

In [3]:
# import the dataset
df = pd.read_csv(r"D:\Masai School Data Analytics\Revision\Assignment-2\datset - Sheet1.csv")

In [4]:
# show the first five rows
df.head()

,OrderID,Date,Region,CustomerName,Product,Quantity,UnitPrice,TotalSales,PaymentMethod
0,1001,2023-01-15,North,Alice Johnson,Laptop,2.0,700.0,1400.0,Credit Card
1,1002,2023-01-16,South,Rahul Mehta,Mobile Phone,5.0,300.0,1500.0,UPI
2,1003,2023-01-17,East,Fatima Noor,Headphones,10.0,50.0,500.0,Debit Card
3,1004,2023-01-18,West,NaN,Laptop,1.0,720.0,720.0,Credit Card
4,1005,2023-01-19,North,Zoe Carter,Mobile Phone,3.0,NaN,NaN,UPI

In [12]:
# shape of the dataset
df.shape

(20, 9)

In [14]:
# Basic statistics
df.describe().T

,count,mean,std,min,25%,50%,75%,max
OrderID,20.0,1010.500000,5.916080,1001.0,1005.75,1010.5,1015.25,1020.0
Quantity,19.0,2.894737,2.233451,1.0,1.50,2.0,3.50,10.0
UnitPrice,18.0,347.777778,246.649443,50.0,196.25,292.5,622.50,720.0
TotalSales,18.0,696.666667,415.575434,200.0,400.00,602.5,855.00,1500.0

In [5]:
# information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderID        20 non-null     int64
 1   Date           20 non-null     object
 2   Region         20 non-null     object
 3   CustomerName   18 non-null     object
 4   Product        20 non-null     object
 5   Quantity       19 non-null     float64
 6   UnitPrice      18 non-null     float64
 7   TotalSales     18 non-null     float64
 8   PaymentMethod  20 non-null     object
dtypes: float64(3), int64(1), object(5)
memory usage: 1.5+ KB

In [6]:
# check the missing values
df.isnull().sum()

OrderID          0
Date             0
Region           0
CustomerName     2
Product          0
Quantity         1
UnitPrice        2
TotalSales       2
PaymentMethod    0
dtype: int64

In [7]:
# Handling missing values
df_clean = df.dropna()

In [8]:
# Task 1: Sum of sales by region
sales_by_region = df_clean.groupby('Region')['TotalSales'].sum()
print("\nSum of Sales by Region:\n", sales_by_region)

Sum of Sales by Region:
 Region
East     2520.0
North    3765.0
South    3830.0
West      585.0
Name: TotalSales, dtype: float64

In [9]:
# Task 2: Average sales per product
avg_sales_product = df_clean.groupby('Product')['TotalSales'].mean()
print("\nAverage Sales per Product:\n", avg_sales_product)

Average Sales per Product:
 Product
Headphones       415.0
Keyboard         342.5
Laptop          1170.0
Mobile Phone     897.5
Monitor          492.5
Smart Watch      200.0
Tablet           900.0
Name: TotalSales, dtype: float64

In [10]:
# Task 3: Highest & lowest selling products
total_sales_product = df_clean.groupby('Product')['TotalSales'].sum()
highest = total_sales_product.idxmax()
lowest = total_sales_product.idxmin()
print(f"\nHighest Selling Product: {highest} - ${total_sales_product.max():.2f}")
print(f"Lowest Selling Product: {lowest} - ${total_sales_product.min():.2f}")

Highest Selling Product: Mobile Phone - $3590.00
Lowest Selling Product: Smart Watch - $200.00

In [11]:
# Task 4: NumPy statistics on numerical columns
numerical_cols = df_clean[['Quantity', 'UnitPrice', 'TotalSales']]

mean_vals = np.mean(numerical_cols, axis=0)
median_vals = np.median(numerical_cols, axis=0)
std_vals = np.std(numerical_cols, axis=0)

print("\nNumPy Statistics:")
print("Mean:\n", mean_vals)
print("Median:\n", median_vals)
print("Standard Deviation:\n", std_vals)

NumPy Statistics:
Mean:
 Quantity        3.200000
UnitPrice     310.000000
TotalSales    713.333333
dtype: float64
Median:
 [  2. 290. 585.]
Standard Deviation:
 Quantity        2.315167
UnitPrice     222.845238
TotalSales    436.247891
dtype: float64